---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures.NoDefaultType
source: html/0bf616f7-f6c6-3b4a-2928-60b115281524.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures.NoDefaultType Property

As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoDefaultType { get; }
```